#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_api_key.management will be created
  + resource "grafana_api_key" "management" {
      + cloud_stack_slug = "oteldemostack"
      + expiration       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + name             = "management-key"
      + role             = "Admin"
    }

  # grafana_cloud_stack.oteldemo will be created
  + resource "grafana_cloud_stack" "oteldemo" {
      + alertmanager_name                = (known after apply)
      + alertmanager_status              = (known after apply)
      + alertmanager_url                 = (known after apply)
      + alertmanager_user_id             = (known after apply)
      + id                               = (known after apply)
      + logs_name                        = (known after apply)
      + logs_status                      = (known after apply)
      + logs_url                         = (known after apply)
      + logs_user_id                     = (known after apply)
      + name                             = "oteldemostack"
      + org_id                           = (known after apply)
      + org_name                         = (known after apply)
      + org_slug                         = (known after apply)
      + prometheus_name                  = (known after apply)
      + prometheus_remote_endpoint       = (known after apply)
      + prometheus_remote_write_endpoint = (known after apply)
      + prometheus_status                = (known after apply)
      + prometheus_url                   = (known after apply)
      + prometheus_user_id               = (known after apply)
      + region_slug                      = "eu"
      + slug                             = "oteldemostack"
      + status                           = (known after apply)
      + url                              = (known after apply)
      + wait_for_readiness               = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @proffalken, Action: `pull_request`*